run/tutorials/incompressible/pimpleFoam/RAS/axialTurbine_rotating_oneBlade/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pFinal)"
    {
        solver           PBiCGStab;
        preconditioner   FDIC;
        tolerance        1e-08;
        relTol           0.05;
    }
    U
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
    UFinal
    {
        $U;
        relTol          0;
    }
    k
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
    epsilon
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0.1;
    }
   "(k|epsilon)Final"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-07;
        relTol           0;
    }

}


PIMPLE
{
    correctPhi          no;
    nOuterCorrectors    10;
    nCorrectors         1;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    p               0.3;
    U               0.7;
    UFinal          0.7; // To avoid sudden increase in pressure residual
    k               0.7;
    epsilon         0.7;
}


// ************************************************************************* //
